Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxGtm_PinMap_TC38x_516.c
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2N_TOUT267_P10_14_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_e, 267, {&MODULE_P10,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT112_P01_4_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 112, {&MODULE_P01, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT132_P22_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_f, 132, {&MODULE_P22, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT157_P01_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_a, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT164_P01_14_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_e, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT176_P31_2_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_a, 176, {&MODULE_P31, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT208_P25_2_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_a, 208, {&MODULE_P25, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT243_P15_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_2_TOUT266_P10_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_e, 266, {&MODULE_P10,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT118_P02_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_f, 118, {&MODULE_P02,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT137_P22_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_g, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT160_P01_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT180_P31_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 180, {&MODULE_P31, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT212_P25_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT212_P26_0_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT247_P15_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_f, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3N_TOUT270_P10_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 270, {&MODULE_P10,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT113_P01_5_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 113, {&MODULE_P01, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT133_P22_7_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_f, 133, {&MODULE_P22, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT165_P01_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT177_P31_3_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 177, {&MODULE_P31, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT209_P25_3_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 209, {&MODULE_P25, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT244_P15_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_3_TOUT269_P10_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 269, {&MODULE_P10,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4N_TOUT151_P02_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 151, {&MODULE_P02,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4N_TOUT165_P01_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4N_TOUT177_P31_3_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 177, {&MODULE_P31, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4N_TOUT209_P25_3_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 209, {&MODULE_P25, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4N_TOUT244_P15_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT110_P10_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 110, {&MODULE_P10, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT111_P01_3_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 111, {&MODULE_P01, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT114_P01_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 114, {&MODULE_P01, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT134_P22_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 134, {&MODULE_P22, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT158_P01_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT178_P31_4_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 178, {&MODULE_P31, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT210_P25_4_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 210, {&MODULE_P25, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_4_TOUT245_P15_13_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 245, {&MODULE_P15,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5N_TOUT153_P02_13_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 153, {&MODULE_P02,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5N_TOUT155_P01_0_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5N_TOUT166_P00_14_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 166, {&MODULE_P00,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5N_TOUT174_P31_0_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 174, {&MODULE_P31, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5N_TOUT206_P25_0_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 206, {&MODULE_P25, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5N_TOUT268_P10_13_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 268, {&MODULE_P10,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT115_P01_7_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 115, {&MODULE_P01, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT135_P22_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 135, {&MODULE_P22, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT159_P01_1_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT179_P31_5_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 179, {&MODULE_P31, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT211_P25_5_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 211, {&MODULE_P25, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT246_P15_14_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 246, {&MODULE_P15,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_5_TOUT265_P10_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 265, {&MODULE_P10, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6N_TOUT154_P02_14_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 154, {&MODULE_P02,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6N_TOUT156_P01_2_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6N_TOUT175_P31_1_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 175, {&MODULE_P31, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6N_TOUT207_P25_1_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 207, {&MODULE_P25, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6N_TOUT242_P15_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6N_TOUT267_P10_14_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 267, {&MODULE_P10,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT136_P22_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT160_P01_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT180_P31_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 180, {&MODULE_P31, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT212_P25_6_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT212_P26_0_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT247_P15_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_6_TOUT266_P10_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 266, {&MODULE_P10,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7N_TOUT152_P02_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7N_TOUT157_P01_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7N_TOUT176_P31_2_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 176, {&MODULE_P31, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7N_TOUT208_P25_2_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 208, {&MODULE_P25, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7N_TOUT243_P15_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7N_TOUT270_P10_15_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 270, {&MODULE_P10,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT137_P22_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT161_P01_13_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT181_P31_7_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 181, {&MODULE_P31, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT213_P25_7_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 213, {&MODULE_P25, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT248_P13_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 248, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_7_TOUT269_P10_11_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 269, {&MODULE_P10,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_8_TOUT162_P01_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_8_TOUT182_P31_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 182, {&MODULE_P31, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_8_TOUT186_P31_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_e, 186, {&MODULE_P31,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_8_TOUT214_P25_8_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 214, {&MODULE_P25, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_8_TOUT218_P25_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_e, 218, {&MODULE_P25,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_8_TOUT249_P13_12_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_9_TOUT163_P01_10_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_9_TOUT183_P31_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 183, {&MODULE_P31, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_9_TOUT187_P31_13_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_e, 187, {&MODULE_P31,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_9_TOUT215_P25_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 215, {&MODULE_P25, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_9_TOUT219_P25_13_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_e, 219, {&MODULE_P25,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM3_9_TOUT265_P10_9_OUT = {IfxGtm_Tom_3, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 265, {&MODULE_P10, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_0_TOUT155_P01_0_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_b, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_0_TOUT162_P01_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_0_TOUT190_P30_0_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 190, {&MODULE_P30, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_0_TOUT222_P24_0_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 222, {&MODULE_P24, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_0_TOUT250_P13_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_b, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_10_TOUT164_P01_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_b, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_10_TOUT200_P30_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 200, {&MODULE_P30,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_10_TOUT204_P30_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_e, 204, {&MODULE_P30,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_10_TOUT232_P24_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 232, {&MODULE_P24,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_10_TOUT260_P14_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_b, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_11_TOUT166_P00_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 166, {&MODULE_P00,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_11_TOUT201_P30_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 201, {&MODULE_P30,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_11_TOUT205_P30_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_e, 205, {&MODULE_P30,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_11_TOUT233_P24_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 233, {&MODULE_P24,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_11_TOUT261_P14_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_12_TOUT167_P00_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 167, {&MODULE_P00,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_12_TOUT202_P30_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 202, {&MODULE_P30,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_12_TOUT230_P24_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_e, 230, {&MODULE_P24, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_12_TOUT234_P24_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 234, {&MODULE_P24,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_12_TOUT262_P13_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 262, {&MODULE_P13,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_13_TOUT168_P00_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 168, {&MODULE_P00,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_13_TOUT203_P30_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_a, 203, {&MODULE_P30,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_13_TOUT231_P24_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_e, 231, {&MODULE_P24, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_13_TOUT235_P24_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_a, 235, {&MODULE_P24,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_13_TOUT263_P14_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_14_TOUT151_P02_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 151, {&MODULE_P02,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_14_TOUT153_P02_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 153, {&MODULE_P02,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_14_TOUT204_P30_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_a, 204, {&MODULE_P30,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_14_TOUT232_P24_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_e, 232, {&MODULE_P24,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_14_TOUT236_P24_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_a, 236, {&MODULE_P24,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_14_TOUT264_P13_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_15_TOUT152_P02_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_15_TOUT154_P02_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 154, {&MODULE_P02,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_15_TOUT205_P30_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_a, 205, {&MODULE_P30,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_15_TOUT233_P24_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_e, 233, {&MODULE_P24,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_15_TOUT237_P24_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_a, 237, {&MODULE_P24,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_1_TOUT156_P01_2_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_1_TOUT163_P01_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_f, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_1_TOUT191_P30_1_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 191, {&MODULE_P30, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_1_TOUT223_P24_1_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 223, {&MODULE_P24, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_1_TOUT251_P13_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_2_TOUT157_P01_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_2_TOUT164_P01_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_f, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_2_TOUT192_P30_2_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_a, 192, {&MODULE_P30, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_2_TOUT224_P24_2_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_a, 224, {&MODULE_P24, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_2_TOUT252_P13_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 252, {&MODULE_P13,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT165_P01_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT193_P30_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 193, {&MODULE_P30, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT225_P24_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 225, {&MODULE_P24, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT253_P13_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT111_P01_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 111, {&MODULE_P01, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT158_P01_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT194_P30_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 194, {&MODULE_P30, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT226_P24_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 226, {&MODULE_P24, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT254_P13_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT8_P02_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 8, {&MODULE_P02, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT116_P02_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 116, {&MODULE_P02, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT159_P01_1_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT195_P30_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 195, {&MODULE_P30, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT227_P24_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 227, {&MODULE_P24, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT255_P13_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT117_P02_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 117, {&MODULE_P02,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT160_P01_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT196_P30_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 196, {&MODULE_P30, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT228_P24_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 228, {&MODULE_P24, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT256_P13_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT118_P02_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 118, {&MODULE_P02,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT161_P01_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT197_P30_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 197, {&MODULE_P30, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT229_P24_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 229, {&MODULE_P24, 7}, IfxPort_OutputIdx_alt1};
