Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxGtm_PinMap_TC38x_516.c
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT264_P13_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_h, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT162_P01_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT198_P30_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 198, {&MODULE_P30, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT202_P30_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_e, 202, {&MODULE_P30,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT230_P24_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 230, {&MODULE_P24, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT258_P14_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT163_P01_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT199_P30_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 199, {&MODULE_P30, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT203_P30_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_e, 203, {&MODULE_P30,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT231_P24_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 231, {&MODULE_P24, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT259_P14_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};

#include "IfxGtm_bf.h"

void IfxGtm_PinMap_setTimTin(IfxGtm_Tim_TinMap *config, IfxPort_InputMode inputMode)
{
    uint32 shift = config->channel * 4;

    __ldmst_c(&(MODULE_GTM.TIMINSEL[config->tim].U), (0xFU << shift), ((uint32)config->select) << shift);

    if (inputMode != IfxPort_InputMode_undefined)
    
{        IfxPort_setPinModeInput(config->pin.port, config->pin.pinIndex, inputMode);
    }
}

void IfxGtm_PinMap_setAtomTout(IfxGtm_Atom_ToutMap *config, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver)
{
    uint32 outselReg = (config->toutn >> 3);
    uint32 shift = (config->toutn & 0x7U) * 4;
    uint32 outsel = (uint32)config->toutSel << shift;
    uint32 mask = 0xFU << shift;
    
    __ldmst_c(&(MODULE_GTM.TOUTSEL[outselReg].U), mask, outsel);

    IfxPort_setPinModeOutput(config->pin.port, config->pin.pinIndex, outputMode, config->select);
    IfxPort_setPinPadDriver(config->pin.port, config->pin.pinIndex, padDriver);
}
void IfxGtm_PinMap_setTomTout(IfxGtm_Tom_ToutMap *config, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver)
{
    uint32 outselReg = (config->toutn >> 3);
    uint32 shift = (config->toutn & 0x7U) * 4;
    uint32 outsel = (uint32)config->toutSel << shift;
    uint32 mask = 0xFU << shift;

    __ldmst_c(&(MODULE_GTM.TOUTSEL[outselReg].U), mask, outsel);

    IfxPort_setPinModeOutput(config->pin.port, config->pin.pinIndex, outputMode, config->select);
    IfxPort_setPinPadDriver(config->pin.port, config->pin.pinIndex, padDriver);
}
#endif

#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
